## PRACTICE EXERCISE
  
**Objective:**
Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.

**Perform the following tasks:**
1. Create a new table named `Books`, with the following columns:
    * BookID (Primary Key, Auto-increment)
    * Title (Title of the book)
    * Author (Author of the book)
    * Genre (Genre of the book)
    * Publication_Year (Year of publication)
    * Price (Price of the Book)
2. Insert at least 3 new books into the `Books` table.
3. Retrieve all books from the Books table.
4. Update the price of a specific book.
5. Delete a book from the table.

In [3]:
%load_ext sql

In [8]:
%sql sqlite:///sql-database.db

### 1. Create table name `Books`

In [27]:
%%sql CREATE TABLE Books (
    BookID INTEGER PRIMARY KEY AUTOINCREMENT,
    Title VARCHAR(100) NOT NULL,
    Author VARCHAR(100) NOT NULL,
    Genre VARCHAR(50),
    Publication_Year INT,
    Price DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sql-database.db
Done.

[]

### 2. Insert at least 3 new books into the `Books` table.

In [29]:
%%sql
INSERT INTO Books (Title, Author, Genre, Publication_Year, Price)
VALUES ('How to Win Friends and Influence People', 'Dale Carnegie', 'Self-Help', '2010', 599.00),
       ("You've Reached Sam: A Novel", 'Dustin Thao', 'Romance', '2021', 595.00),
       ('The Unbearable Lightness of Being', 'Milan Kundera', 'Contemporary Fiction', '2005', 350.00);

 * sqlite:///sql-database.db
3 rows affected.

[]

### 3. Retrieve all books from the Books table.

In [30]:
%sql SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(1, 'How to Win Friends and Influence People', 'Dale Carnegie', 'Self-Help', 2010, 599),
 (2, "You've Reached Sam: A Novel", 'Dustin Thao', 'Romance', 2021, 595),
 (3, 'The Unbearable Lightness of Being', 'Milan Kundera', 'Contemporary Fiction', 2005, 350)]

### 4. Update the price of a specific book.

In [31]:
%%sql UPDATE Books
SET Price = 560.00
WHERE BookID = 2;

 * sqlite:///sql-database.db
1 rows affected.

[]

In [32]:
%sql SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(1, 'How to Win Friends and Influence People', 'Dale Carnegie', 'Self-Help', 2010, 599),
 (2, "You've Reached Sam: A Novel", 'Dustin Thao', 'Romance', 2021, 560),
 (3, 'The Unbearable Lightness of Being', 'Milan Kundera', 'Contemporary Fiction', 2005, 350)]

### 5. Delete a book from the table.

In [33]:
%%sql DELETE FROM Books
WHERE BookID = 3;

 * sqlite:///sql-database.db
1 rows affected.

[]

In [34]:
%sql SELECT * FROM Books;

 * sqlite:///sql-database.db
Done.

[(1, 'How to Win Friends and Influence People', 'Dale Carnegie', 'Self-Help', 2010, 599),
 (2, "You've Reached Sam: A Novel", 'Dustin Thao', 'Romance', 2021, 560)]